import pytest

from src.temp import main_make_temp

test_data_general = {
    "تصنيف:عقد 90 حسب البلد": ["{{تصنيف عقد|قرن=1|عقد=90|حسب=حسب البلد}}", "تصنيف عقد"],
    "تصنيف:عقد 560 حسب البلد": ["{{تصنيف عقد|قرن=6|عقد=560|حسب=حسب البلد}}", "تصنيف عقد"],
    "تصنيف:عقد 560": ["{{تصنيف عقد|قرن=6|عقد=560}}", "تصنيف عقد"],
    "تصنيف:عقد 2010 حسب البلد": ["{{تصنيف عقد|قرن=21|عقد=2010|حسب=حسب البلد}}", "تصنيف عقد"],
    "تصنيف:عقد 90": ["{{تصنيف عقد|قرن=1|عقد=90}}", "تصنيف عقد"],
    "تصنيف:عقد 2010 ": ["{{تصنيف عقد|قرن=21|عقد=2010}}", "تصنيف عقد"],
    "تصنيف:تأسيسات عقد 2010 ": ["{{تأسيس عقد|قرن=21|عقد=2010}}", "تأسيس عقد"],
    "تصنيف:عقد 2010 في أوقيانوسيا": ["{{تصنيف عقد|قرن=21|عقد=2010|بلد=أوقيانوسيا}}", "تصنيف عقد"],
    "تصنيف:تأسيسات عقد 2010 في أوقيانوسيا": ["{{تأسيس عقد|قرن=21|عقد=2010|بلد=أوقيانوسيا}}", "تأسيس عقد"],
    "تصنيف:انحلالات عقد 2010 في أوقيانوسيا": ["{{انحلال عقد|قرن=21|عقد=2010|بلد=أوقيانوسيا}}", "انحلال عقد"],
}

test_data_year = {
    "تصنيف:2020 في أوقيانوسيا": ["{{تصنيف موسم}}", "تصنيف موسم"],
    "تصنيف:تأسيسات سنة 2020": ["{{تأسيس سنة|202|0}}", "تأسيس سنة"],
    "تصنيف:تأسيسات سنة 2020 في أوقيانوسيا": ["{{تأسيس بلد|202|0|أوقيانوسيا}}", "تأسيس بلد"],
    "تصنيف:تأسيسات سنة 2020 حسب البلد": ["{{تأسيس بلد|202|0|حسب البلد|في=}}", "تأسيس بلد"],
    "تصنيف:انحلالات سنة 2020 في أوقيانوسيا": ["{{انحلال بلد|202|0|أوقيانوسيا}}", "انحلال بلد"],
    "تصنيف:انحلالات سنة 2020 حسب البلد": ["{{انحلال بلد|202|0|حسب البلد|في=}}", "انحلال بلد"],
    "تصنيف:انحلالات سنة 2020": ["{{انحلال سنة|202|0}}", "انحلال سنة"],
    "تصنيف:2020 حسب البلد": ["{{تصنيف موسم}}", "تصنيف موسم"],
    "تصنيف:2020": ["{{تصنيف موسم}}", "تصنيف موسم"],
    "تصنيف:وفيات سنة 2020": ["{{تصنيف موسم}}", "تصنيف موسم"],
}

test_data_decade = {
    "تصنيف:عقد 2010 في أوقيانوسيا": ["{{تصنيف عقد|قرن=21|عقد=2010|بلد=أوقيانوسيا}}", "تصنيف عقد"],
    "تصنيف:تأسيسات عقد 2010": ["{{تأسيس عقد|قرن=21|عقد=2010}}", "تأسيس عقد"],
    "تصنيف:تأسيسات عقد 2010 في أوقيانوسيا": ["{{تأسيس عقد|قرن=21|عقد=2010|بلد=أوقيانوسيا}}", "تأسيس عقد"],
    "تصنيف:تأسيسات عقد 2010 حسب البلد": ["{{تأسيس عقد|قرن=21|عقد=2010|حسب=حسب البلد}}", "تأسيس عقد"],
    "تصنيف:انحلالات عقد 2010 في أوقيانوسيا": ["{{انحلال عقد|قرن=21|عقد=2010|بلد=أوقيانوسيا}}", "انحلال عقد"],
    "تصنيف:انحلالات عقد 2010 حسب البلد": ["{{انحلال عقد|قرن=21|عقد=2010|حسب=حسب البلد}}", "انحلال عقد"],
    "تصنيف:انحلالات عقد 2010": ["{{انحلال عقد|قرن=21|عقد=2010}}", "انحلال عقد"],
    "تصنيف:عقد 2010 حسب البلد": ["{{تصنيف عقد|قرن=21|عقد=2010|حسب=حسب البلد}}", "تصنيف عقد"],
    "تصنيف:عقد 2010": ["{{تصنيف عقد|قرن=21|عقد=2010}}", "تصنيف عقد"],
    "تصنيف:وفيات عقد 2010": ["{{تصنيف موسم}}", "تصنيف موسم"],
}

test_data_century = {
    "تصنيف:القرن 19 في أوقيانوسيا": ["{{سنوات في القرن|19|بلد=أوقيانوسيا}}", "سنوات في القرن"],
    "تصنيف:تأسيسات القرن 19": ["{{تأسيس قرن|19}}", "تأسيس قرن"],
    "تصنيف:تأسيسات القرن 19 في أوقيانوسيا": ["{{تأسيس قرن|19|بلد=أوقيانوسيا}}", "تأسيس قرن"],
    "تصنيف:تأسيسات القرن 19 حسب البلد": ["{{تأسيس قرن|19|حسب=حسب البلد}}", "تأسيس قرن"],
    "تصنيف:انحلالات القرن 19 في أوقيانوسيا": ["{{انحلال قرن|19|بلد=أوقيانوسيا}}", "انحلال قرن"],
    "تصنيف:انحلالات القرن 19 حسب البلد": ["{{انحلال قرن|19|حسب=حسب البلد}}", "انحلال قرن"],
    "تصنيف:انحلالات القرن 19": ["{{انحلال قرن|19}}", "انحلال قرن"],
    "تصنيف:القرن 19 حسب البلد": ["{{سنوات في القرن|19|حسب=حسب البلد}}", "سنوات في القرن"],
    "تصنيف:القرن 19": ["{{سنوات في القرن|19}}", "سنوات في القرن"],
    "تصنيف:وفيات القرن 19": ["{{تصنيف موسم}}", "تصنيف موسم"],
}

test_data_millennium = {
    "تصنيف:الألفية 3 في أوقيانوسيا": ["{{الألفية 3 في بلد|أوقيانوسيا}}", "الألفية 3 في بلد"],
    "تصنيف:تأسيسات الألفية 3": ["{{تأسيس  الألفية 3}}", "تأسيس  الألفية 3"],
    "تصنيف:تأسيسات الألفية 3 في أوقيانوسيا": ["{{تأسيس بلد الألفية 3|أوقيانوسيا}}", "تأسيس بلد الألفية 3"],
    "تصنيف:تأسيسات الألفية 3 حسب البلد": ["{{تأسيس بلد الألفية 3|حسب البلد|في=}}", "تأسيس بلد الألفية 3"],
    "تصنيف:انحلالات الألفية 3 في أوقيانوسيا": ["{{انحلال بلد الألفية 3|أوقيانوسيا}}", "انحلال بلد الألفية 3"],
    "تصنيف:انحلالات الألفية 3 حسب البلد": ["{{انحلال بلد الألفية 3|حسب البلد|في=}}", "انحلال بلد الألفية 3"],
    "تصنيف:انحلالات الألفية 3": ["{{انحلال  الألفية 3}}", "انحلال  الألفية 3"],
    "تصنيف:الألفية 3 حسب البلد": ["{{الألفية 3 في بلد|حسب البلد|في=}}", "الألفية 3 في بلد"],
    "تصنيف:الألفية 3": ["{{ الألفية 3}}", " الألفية 3"],
    "تصنيف:وفيات الألفية 3": ["{{تصنيف موسم}}", "تصنيف موسم"],
}


@pytest.mark.parametrize("cat, expected", test_data_general.items(), ids=test_data_general.keys())
def test_general(cat: str, expected):
    result, temp_name = main_make_temp("", cat)
    assert [result, temp_name] == expected


@pytest.mark.parametrize("cat, expected", test_data_decade.items(), ids=test_data_decade.keys())
def test_decade(cat: str, expected):
    result, temp_name = main_make_temp("", cat)
    assert [result, temp_name] == expected


@pytest.mark.parametrize("cat, expected", test_data_century.items(), ids=test_data_century.keys())
def test_century(cat: str, expected):
    result, temp_name = main_make_temp("", cat)
    assert [result, temp_name] == expected


@pytest.mark.parametrize("cat, expected", test_data_millennium.items(), ids=test_data_millennium.keys())
def test_millennium(cat: str, expected):
    result, temp_name = main_make_temp("", cat)
    assert [result, temp_name] == expected
